In [2]:
from MySQLdb import connect
import pandas as pd

/var/folders/fb/xl0hnskx527bfqkv38l3sn7h0000gn/T/ipykernel_7841/3687392072.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
# Connect to your MySQLdb
#conn = connect(host='localhost', user='root')
conn = connect(host='127.0.0.1', user='root', password = 'root', port = 8890)

In [4]:
# Open a cursor to perform database operations
cur = conn.cursor()

In [5]:
# Return data from the Customers table:
cur.execute('''SHOW DATABASES;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

             Database
0  information_schema
1               mysql
2  performance_schema
3              sqlw3s
4                 sys
5              testDB

### SQL NOT NULL Constraint
By default, a column can hold NULL values.

The NOT NULL constraint enforces a column to NOT accept NULL values.

This enforces a field to always contain a value, which means that you cannot insert a new record, or update a record without adding a value to this field.

- SQL NOT NULL on CREATE TABLE

In [6]:
cur.execute('''DROP TABLE testDB.Persons;''')

0

In [7]:
# The following SQL ensures that the "ID", "LastName", and "FirstName" columns will NOT accept NULL values
# when the "Persons" table is created:
cur.execute('''CREATE TABLE testDB.Persons (
    ID int NOT NULL,
    LastName varchar(255) NOT NULL,
    FirstName varchar(255) NOT NULL,
    Age int
);''')

0

- SQL NOT NULL on ALTER TABLE
To create a NOT NULL constraint on the "Age" column when the "Persons" table is already created, use the following SQL:

>SQL Server / MS Access:
>
>ALTER TABLE Persons
>
>ALTER COLUMN Age int NOT NULL;

>My SQL / Oracle (prior version 10G):
>
>ALTER TABLE Persons
>
>MODIFY COLUMN Age int NOT NULL;

>Oracle 10G and later:
>
>ALTER TABLE Persons
>
>MODIFY Age int NOT NULL;

>postgre:
>
>ALTER TABLE public.bill4 ALTER COLUMN id SET NOT NULL;
>
>ALTER TABLE public.bill4 ALTER COLUMN id DROP NOT NULL;

In [8]:
# In MySQL, nullability is a part of the datatype, not a constraint. So:
cur.execute('''ALTER TABLE testDB.Persons MODIFY COLUMN ID int null;''')

0

In [9]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

  ID LastName FirstName Age
0

In [10]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null Key Default Extra
0         ID       int(11)  YES        None
1   LastName  varchar(255)   NO        None
2  FirstName  varchar(255)   NO        None
3        Age       int(11)  YES        None

In [11]:
# make not null again
cur.execute('''ALTER TABLE testDB.Persons MODIFY COLUMN ID int NOT null;''')

0

In [12]:
# Return data from the Customers table:
cur.execute('''DESCRIBE testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

       Field          Type Null Key Default Extra
0         ID       int(11)   NO        None
1   LastName  varchar(255)   NO        None
2  FirstName  varchar(255)   NO        None
3        Age       int(11)  YES        None

In [15]:
cur.execute('''INSERT INTO testDB.Persons (id, LastName, FirstName) VALUES (1, 'Alice', 'Cooper');''')

1

In [16]:
# Return data from the CustomersNew table:
cur.execute('''SELECT * FROM testDB.Persons;''')
df = pd.DataFrame(tuple(t) for t in cur.fetchall())
columns = [i[0] for i in cur.description]
if len(df) == 0: df = pd.DataFrame([["" for i in range(len(columns))]])
df.columns = columns
df

   ID LastName FirstName   Age
0   1    Alice    Cooper  None